{
  "git_workflow_protocol": {
    "name": "Git Workflow and Commit Signing Protocol",
    "summary": "Defines the standard operating procedures for Git usage, including commit signing, for this agent.",
    "rules": [
      {
        "name": "Commit Signing Configuration",
        "description": "To ensure the integrity of commits made by the agent while not interfering with the user's global Git configuration, the following setup is used:",
        "steps": [
          "Global commit signing is explicitly disabled (`git config --global commit.gpgsign false`) to avoid affecting the user's other repositories.",
          "Repository-level commit signing is enabled for this specific repository (`git config commit.gpgsign true`), ensuring all commits made by the agent are signed.",
          "The signing key is a dedicated SSH key located at `.gemini/.ssh/user_key`.",
          "The Git GPG format is set to 'ssh' (`git config --global gpg.format ssh`).",
          "An `allowed_signers` file at `.gemini/.ssh/allowed_signers` is used to verify the key, linking the user's email to the public key."
        ],
        "outcome": "All commits made by the agent within this repository will be automatically signed with the designated SSH key. The user's commits outside of this session or in other repositories remain unaffected."
      },
      {
        "name": "Commit Frequency",
        "description": "The agent must propose a commit after every successful file modification or other significant change to the repository state. This is part of the 'Mutual Agreement' to ensure continuous progress and a detailed history."
      },
      {
        "name": "Nested Repository Handling",
        "description": "This repository acts as a 'meta-repo' and contains other, separate Git repositories within its directory structure (e.g., in '.chat/' and 'repos/'). These nested repositories are ignored by this parent repository's .gitignore file.",
        "rule": "The agent must not attempt to stage or commit changes to files within these nested repositories from the parent repository. All Git operations for a nested repository must be performed from within that nested repository's own directory."
      },
      {
        "name": "Agent Identity",
        "description": "Each agent instance must have a unique identity for Git commits. The agent naming protocol is defined in `swarm_protocol.json`.",
        "rule": "The agent must follow the `swarm_protocol.json` to configure its Git `user.name` and `user.email`."
      },
      {
        "name": "Pre-commit Identity Check",
        "description": "Crucially, before *every* commit to *any* repository, the agent must proactively verify that the local `user.name` and `user.email` are accurate and strictly adhere to the agent's current identity and the required format. The timestamp is the unique identifier for the agent's session, derived from the agent's unclean chat log filename.",
        "rule": "The agent must check the local `user.name` and `user.email` of the repository. The format must be `<AGENT_NAME>` for the `user.name` and `<TIMESTAMP>@localhost` for the `user.email`. If the configuration is incorrect, the agent must update it before committing."
      }
    ]
  }
}